//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct SPRITE
{
	XMFLOAT2	pos;		// テクスチャの位置
	XMFLOAT2	size;		// テクスチャの大きさ
	XMFLOAT4	color;		// テクスチャの色

	bool		useColor;	// 色描画を使うフラグ
	bool		use;		// 描画可能フラグ
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);


